{
    "courses":[
        {
            "id":1,
            "content": "ReactJS, geliştiriciler tarafından web uygulamaları için kullanıcı arayüzleri oluşturmak amacıyla kullanılan güçlü bir JavaScript kütüphanesidir. İlk olarak 2011 yılında Facebook tarafından web sitelerinin performansını artırmak için oluşturuldu ve o zamandan beri dünya çapındaki geliştiriciler tarafından yaygın bir şekilde benimsendi. React JS'nin en önemli avantajlarından biri, tüm sayfayı yeniden yüklemeye gerek kalmadan kullanıcı arayüzünü verimli bir şekilde güncellemesine olanak tanıyan sanal DOM'udur. Ayrıca React JS, karmaşık kod tabanlarını basitleştirmeye ve geliştirmeyi daha hızlı ve verimli hale getirmeye yardımcı olabilecek yeniden kullanılabilir bileşenler oluşturmayı kolaylaştırır.",
            "title": "React",
            "price": 300
        
        },
        {
            "id":2,
            "content": "Vue, kullanıcı arayüzü (UI) ve tek sayfalı uygulamalar oluşturmayı sağlayan, açık kaynaklı popüler bir Javascript kütüphanesi. Vue.js ile modern, küçük, orta ve büyük ölçekli mobil ve masaüstü uygulamalar oluşturmak mümkün.DOM yani Document Object Model üzerinde değişiklik yapmak maliyetli olduğu için Vue.js virtual DOM kullanır. Model-görünüm-görünüm modeli yani kısaca MVVM mimari deseni kullanır ve bu mimari modelin GUI (Grafik Kullanıcı Arayüzü) ve görünümden ayırt edilmesini sağlar. Bu ayrım, Frontend ve Backend geliştiricilerin birlikte çalışmasını sağlar.",
            "title": "Vue",
            "price": 100
        
        },
        {
            "id":3,
            "content": "AngularJS, dinamik web uygulamaları için yapısal bir frameworktür. HTML'i şablon dili olarak kullanmanızı sağlar ve uygulamanın bileşenlerini açık bir şekilde ifade etmek için HTML sözdizimini genişletmenize izin verir. Angular'ın veri bağlama ve bağımlılık enjeksiyonu, aksi takdirde yazmak zorunda kalacağınız kodun çoğunu ortadan kaldırır. Hepsi tarayıcıda olur ve herhangi bir sunucu teknolojisi ile ideal bir ortaklık yapar.",
            "title": "Angular",
            "price": 200
        
        },
        {
            "id":4,
            "content": "Arkadaşlar bu yazımda sizlere Node.js nedir? Node.js neden şu an çok popüler ve Node.js ile neler yapabileceğinizi anlatacağım.Javascript programlama dili bildiğiniz üzere eskiden sadece istemci tarafında (client-side) çalışan bir dildi. Tarayıcıda çalıştırdığımız Chrome V8 Engine kullanıma sunuldu ve artık sunucu tarafında da (server-side) Javascript dilini kullanabiliyoruz. İşte Javascript dilini sunucu tarafında kullanmamıza olanak sağlayan Chrome V8 Engine, Node.js olarak adlandırılmaktadır.",
            "title": "Node",
            "price": 400
        },
        {
            "id":4,
            "content": "jQuery çapraz platform destekli, açık kaynaklı, geliştiriciler tarafından sıklıkla tercih edilen bir JavaScript kütüphanesidir. “Az kodla, fazlasını yap” mantığına dayanan jQuery, JavaScript ile birlikte çalışarak programlamayı kolaylaştırmayı amaçlar. Yani sanıldığının aksine ayrı bir program dili değildir.jQuery’nin temel amacı, çok uzun ve karmaşık kod satırlarını tek bir koda sıkıştırmak ve böylece yüzlerce kodu yeniden yazmak zorunda kalmamak. Daha az kod satırıyla yüksek performanslı JavaScript uygulamaları yazılır. En önemli özelliklerinden bir tanesi de tarayıcılar üzerinde çalışmayı sağlar. ",
            "title": "Jquery",
            "price": 50
        }


    ]
}
